In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [3]:
df=sns.load_dataset("tips")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
print(df.shape)

(244, 7)

In [5]:
print(df.head())

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
print(df.columns)

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [8]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [9]:
df.describe

<bound method NDFrame.describe of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

In [10]:
import seaborn as sns
import pandas as pd

# Load dataset
df = sns.load_dataset("tips")

# Check the shape of the dataset
print(df.shape)  # (rows, columns)

# Preview the first few rows
print(df.head())

# Check for missing values
print(df.isnull().sum())

# Get summary statistics
print(df.describe())

# Check data types
print(df.dtypes)

# Check unique values in categorical columns
print(df['sex'].unique())
print(df['smoker'].unique())
print(df['day'].unique())
print(df['time'].unique())

(244, 7)
   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64
       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000
total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object
['Female', 'Male']
Categories (2, object): ['Male', 'Female']
['No', 'Yes']
Categories (2, object): ['Yes', 'No']
['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']
['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [11]:
print(df.isnull().sum())

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [12]:
print(df.describe())

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [13]:
print(df['sex'].unique())

['Female', 'Male']
Categories (2, object): ['Male', 'Female']

In [14]:
print(df['smoker'].unique())

['No', 'Yes']
Categories (2, object): ['Yes', 'No']

In [15]:
print(df['day'].unique())

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Thur', 'Fri', 'Sat', 'Sun']

In [16]:
print(df['time'].unique())

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [17]:
df.describe(include="category")

         sex smoker  day    time
count    244    244  244     244
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

In [18]:
df.describe(include="float64")

       total_bill         tip
count  244.000000  244.000000
mean    19.785943    2.998279
std      8.902412    1.383638
min      3.070000    1.000000
25%     13.347500    2.000000
50%     17.795000    2.900000
75%     24.127500    3.562500
max     50.810000   10.000000

In [19]:
df.describe(include="int64")

             size
count  244.000000
mean     2.569672
std      0.951100
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [20]:
INSIGHTS:-
Here we are getting the summary of the statistics
- Average total bill is around 19 → most customers spend a moderate amount.
- Average tip is around 3 → tipping is fairly consistent.
- Bills vary a lot, tips vary less → people tip in a predictable range.
- Average group size is 2–3 → mostly small groups or couples.
- No missing values in numeric columns → data is clean

SyntaxError: invalid character '→' (U+2192) (304672003.py, line 3)

In [ ]:
INSIGHTS:-
Here we are getting the summary of the statistics
- Average total bill is around 19 → most customers spend a moderate amount.
- Average tip is around 3 → tipping is fairly consistent.
- Bills vary a lot, tips vary less → people tip in a predictable range.
- Average group size is 2–3 → mostly small groups or couples.
- No missing values in numeric columns → data is clean

In [ ]:
INSIGHTS:-
1. Most customers spend a moderate amount
- The average total bill is around 19.
- Bills range from very small (around 3) to quite large (around 50).
2. Tipping behavior is fairly consistent
- Average tip is around 3.
- Tips don’t vary as much as total bills, meaning people tip in a predictable range.
3. Small groups dominate
- Average group size is 2–3 people.
- Maximum size is 6, so large groups are rare.
4. Higher bills usually lead to higher tips
- Since both max bill and max tip are high, customers who spend more tend to tip more.
5. Dataset is clean
- No missing values in numeric columns.
- Ready for analysis without cleaning.

In [21]:
#NULL VALUE TREATMENT AND IMMPUTATION 
print(df.isnull().sum())

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [22]:
(df.isna().sum()/df.shape[0])

total_bill    0.0
tip           0.0
sex           0.0
smoker        0.0
day           0.0
time          0.0
size          0.0
dtype: float64

In [23]:
print((100/244)*100)

40.98360655737705

In [24]:
print((50/244)*100)

20.491803278688526

In [25]:
df=sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
print(df.isnull().sum())

In [ ]:
print(df.dtypes)

In [ ]:
print(df['sex'].unique())

In [ ]:
print(df['pclass'].unique())

In [ ]:
df.dtypes

In [ ]:
print(df.isnull().sum())

In [ ]:
(df.isna().sum()/df.shape[0]*100)

In [ ]:
(df.shape[0]-df.dropna().shape[0]/df.shape[0]*100)

In [ ]:
df.shape[0]

In [ ]:
((891-182)/891*100)

In [ ]:
(df.isna().sum()/df.shape[0])*100

In [ ]:
df.drop(columns=['deck'], inplace=True)

In [ ]:
(df.isna().sum()/df.shape[0])*100

In [ ]:
df.info()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['survived'])
plt.show

In [ ]:
2
2
2
2
3
2
1
3
4

In [ ]:

plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['sex'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['sex'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['alone'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'],kde=True)
plt.show()

In [ ]:
#bivariate analysis
plt.figure(figsize=(5,5))
sns.histplot(x=df['survived'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['age'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['sibsp'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['parch'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['fare'],hue=df['sex'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['survived'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['age'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['sibsp'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['parch'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['fare'],hue=df['embarked'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['survived'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['age'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['sibsp'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['parch'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['fare'],hue=df['class'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['survived'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['age'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['pclass'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['sibsp'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['parch'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.histplot(x=df['fare'],hue=df['who'],kde=True)
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['sex'],hue=df['alone'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['class'],hue=df['alive'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['alone'],hue=df['alive'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['who'],hue=df['alive'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['class'],hue=df['alive'])
plt.show()

In [ ]:
plt.figure(figsize=(5,5))
sns.countplot(x=df['embark_town'],hue=df['alive'])
plt.show()